---
kind: other
id: Methods.T:Autodesk.Revit.DB.SynchronizeWithCentralOptions
source: html/d13fd36e-f1c2-c685-a7f9-1d23d8ac778c.htm
---
# SynchronizeWithCentralOptions Methods

Gets the options which govern whether or not to relinquish elements and workset types.